Ran Plan for 3 projects:

1. dir: `infra/aws/terraform/artifacts.k8s.io` workspace: `default`
1. dir: `infra/aws/terraform/artifacts.k8s.io/s3` workspace: `default`
1. dir: `infra/aws/terraform/management-account` workspace: `default`
---

### 1. dir: `infra/aws/terraform/artifacts.k8s.io` workspace: `default`
**Plan Error**
```
running 'sh -c' '/atlantis/bin/terraform1.13.4 init -input=false -upgrade' in '/atlantis/repos/kubernetes/k8s.io/8686/default/infra/aws/terraform/artifacts.k8s.io': exit status 1
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
╷
│ Error: Error refreshing state: Unable to access object "terraform.tfstate" in S3 bucket "artifacts-k8s-io-tfstate": operation error S3: HeadObject, https response error StatusCode: 403, RequestID: GS6V9T45314TDPVD, HostID: qsFMMbqJklhAJMX5gNfsESCiKLgMI5IbQdqhF+GFLy0yGmODqTlGjfl2b8aJwGmEIRxHr9yDMFw3laXo4Tq5B0aBW0gcaZXTQ9k4zSpv3gM=, api error Forbidden: Forbidden
│ 
│ 
╵

```

---
### 2. dir: `infra/aws/terraform/artifacts.k8s.io/s3` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.artifacts-k8s-io will be created
+ resource "aws_s3_bucket" "artifacts-k8s-io" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "artifacts-k8s-io-us-east-2"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.artifacts-k8s-io will be created
+ resource "aws_s3_bucket_acl" "artifacts-k8s-io" {
      + acl    = "private"
      + bucket = "artifacts-k8s-io-us-east-2"
      + id     = (known after apply)
      + region = "us-east-2"

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_ownership_controls.artifacts-k8s-io will be created
+ resource "aws_s3_bucket_ownership_controls" "artifacts-k8s-io" {
      + bucket = "artifacts-k8s-io-us-east-2"
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_policy.artifacts-k8s-io-public-read will be created
+ resource "aws_s3_bucket_policy" "artifacts-k8s-io-public-read" {
      + bucket = "artifacts-k8s-io-us-east-2"
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-2"
    }

  # aws_s3_bucket_versioning.artifacts-k8s-io will be created
+ resource "aws_s3_bucket_versioning" "artifacts-k8s-io" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on main.tf line 20, in resource "aws_s3_bucket" "artifacts-k8s-io":
│   20:   bucket = "${var.prefix}artifacts-k8s-io-${data.aws_region.current.name}"
│ 
│ The attribute "name" is deprecated. Refer to the provider documentation for
│ details.
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/aws/terraform/artifacts.k8s.io/s3
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.k8s.io/lock?id=kubernetes%252Fk8s.io%252Finfra%252Faws%252Fterraform%252Fartifacts.k8s.io%252Fs3%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/aws/terraform/artifacts.k8s.io/s3
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
### 3. dir: `infra/aws/terraform/management-account` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cur_reports_integration_athena_s3_bucket.aws_s3_bucket.this[0] has changed
~ resource "aws_s3_bucket" "this" {
      + bucket_region               = "us-east-1"
        id                          = "k8s-infra-cur-reports-athena-bucket"
        tags                        = {}
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cur_reports_s3_bucket.aws_s3_bucket.this[0] has changed
~ resource "aws_s3_bucket" "this" {
      + bucket_region               = "us-east-1"
        id                          = "k8s-infra-cur-reports-bucket"
        tags                        = {}
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
- destroy

Terraform will perform the following actions:

  # aws_iam_user.bentheelder will be destroyed
  # (because aws_iam_user.bentheelder is not in configuration)
- resource "aws_iam_user" "bentheelder" {
      - arn                  = "arn:aws:iam::348685125169:user/bentheelder" -> null
      - force_destroy        = false -> null
      - id                   = "bentheelder" -> null
      - name                 = "bentheelder" -> null
      - path                 = "/" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
      - unique_id            = "AIDAVCL2AYYY5RFHLQZJC" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_user_login_profile.bentheelder_login will be destroyed
  # (because aws_iam_user_login_profile.bentheelder_login is not in configuration)
- resource "aws_iam_user_login_profile" "bentheelder_login" {
      - id                      = "bentheelder" -> null
      - password                = (sensitive value) -> null
      - password_length         = 20 -> null
      - password_reset_required = false -> null
      - user                    = "bentheelder" -> null
    }

  # aws_iam_user_policy_attachment.bentheelder_billing will be destroyed
  # (because aws_iam_user_policy_attachment.bentheelder_billing is not in configuration)
- resource "aws_iam_user_policy_attachment" "bentheelder_billing" {
      - id         = "bentheelder-20230328164714983500000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AWSBillingReadOnlyAccess" -> null
      - user       = "bentheelder" -> null
    }

  # module.cur_reports_integration_athena_s3_bucket.aws_s3_bucket_public_access_block.this[0] will be updated in-place
~ resource "aws_s3_bucket_public_access_block" "this" {
        id                      = "k8s-infra-cur-reports-athena-bucket"
      + skip_destroy            = true
        # (6 unchanged attributes hidden)
    }

  # module.cur_reports_s3_bucket.aws_s3_bucket_public_access_block.this[0] will be updated in-place
~ resource "aws_s3_bucket_public_access_block" "this" {
        id                      = "k8s-infra-cur-reports-bucket"
      + skip_destroy            = true
        # (6 unchanged attributes hidden)
    }

  # module.k8s_infra_e2e_boskos_001.aws_organizations_account.this will be destroyed
  # (because aws_organizations_account.this is not in configuration)
- resource "aws_organizations_account" "this" {
      - arn                        = "arn:aws:organizations::348685125169:account/o-kz4vlkihvy/144171684817" -> null
      - close_on_deletion          = false -> null
      - create_govcloud            = false -> null
      - email                      = "k8s-infra-aws-admins+k8s-infra-e2e-boskos-001@kubernetes.io" -> null
      - iam_user_access_to_billing = "ALLOW" -> null
      - id                         = "144171684817" -> null
      - joined_method              = "CREATED" -> null
      - joined_timestamp           = "2023-03-22T20:16:50Z" -> null
      - name                       = "k8s-infra-e2e-boskos-001" -> null
      - parent_id                  = "ou-unv1-z45kp70m" -> null
      - status                     = "ACTIVE" -> null
      - tags                       = {} -> null
      - tags_all                   = {} -> null
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 2 to change, 4 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/aws/terraform/management-account
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.k8s.io/lock?id=kubernetes%252Fk8s.io%252Finfra%252Faws%252Fterraform%252Fmanagement-account%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/aws/terraform/management-account
  ```

**Note: Objects have changed outside of Terraform**
Plan: 0 to add, 2 to change, 4 to destroy.

---
### Plan Summary

3 projects, 2 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```